FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth_map.h
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : stm32fxxx_eth_map.h
* Author             : MCD Application Team
* Version            : VX.Y.Z
* Date               : mm/dd/2008
* Description        : This file contains all ETHERNET peripheral register's
*                      definitions and memory mapping.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32FXXX_ETH_MAP_H
#define __STM32FXXX_ETH_MAP_H

#ifndef EXT
  #define EXT extern
#endif /* EXT */

/* Includes ------------------------------------------------------------------*/

#include "stm32fxxx_eth_conf.h"
#include "stm32f10x_type.h"

/* Exported types ------------------------------------------------------------*/
/******************************************************************************/
/*                Ethernet Peripheral registers structures                    */
/******************************************************************************/

typedef struct
{
  vu32 MACCR;
  vu32 MACFFR;
  vu32 MACHTHR;
  vu32 MACHTLR;
  vu32 MACMIIAR;
  vu32 MACMIIDR;
  vu32 MACFCR;
  vu32 MACVLANTR;
  vu32 RESERVED0[2];
  vu32 MACRWUFFR;
  vu32 MACPMTCSR;
  vu32 RESERVED1[2];
  vu32 MACSR;
  vu32 MACIMR;
  vu32 MACA0HR;
  vu32 MACA0LR;
  vu32 MACA1HR;
  vu32 MACA1LR;
  vu32 MACA2HR;
  vu32 MACA2LR;
  vu32 MACA3HR;
  vu32 MACA3LR;
} ETH_MAC_TypeDef;

typedef struct
{
  vu32 MMCCR;
  vu32 MMCRIR;
  vu32 MMCTIR;
  vu32 MMCRIMR;
  vu32 MMCTIMR;
  vu32 RESERVED0[14];
  vu32 MMCTGFSCCR;
  vu32 MMCTGFMSCCR;
  vu32 RESERVED1[5];
  vu32 MMCTGFCR;
  vu32 RESERVED2[10];
  vu32 MMCRFCECR;
  vu32 MMCRFAER;
  vu32 RESERVED3[10];
  vu32 MMCRGUFCR;
} ETH_MMC_TypeDef;

typedef struct
{
  vu32 PTPTSCR;
  vu32 PTPSSIR;
  vu32 PTPTSHR;
  vu32 PTPTSLR;
  vu32 PTPTSHUR;
  vu32 PTPTSLUR;
  vu32 PTPTSAR;
  vu32 PTPTTHR;
  vu32 PTPTTLR;
} ETH_PTP_TypeDef;

typedef struct
{
  vu32 DMABMR;
  vu32 DMATPDR;
  vu32 DMARPDR;
  vu32 DMARDLAR;
  vu32 DMATDLAR;
  vu32 DMASR;
  vu32 DMAOMR;
  vu32 DMAIER;
  vu32 DMAMFBOCR;
  vu32 RESERVED0[9];
  vu32 DMACHTDR;
  vu32 DMACHRDR;
  vu32 DMACHTBAR;
  vu32 DMACHRBAR;
} ETH_DMA_TypeDef;

/******************************************************************************/
/*                Ethernet MAC Registers bits definitions                     */
/******************************************************************************/
//#define  IPNAME_REGNAME_BITNAME   /* BIT MASK */

/* Bit definition for Ethernet MAC Control Register register */
#define ETH_MACCR_WD      ((u32)0x00800000)  /* Watchdog disable */
#define ETH_MACCR_JD      ((u32)0x00400000)  /* Jabber disable */
#define ETH_MACCR_JFE     ((u32)0x00100000)  /* Jumbo frame enable */
#define ETH_MACCR_IFG     ((u32)0x000E0000)  /* Inter-frame gap */
  #define ETH_MACCR_IFG_96Bit     ((u32)0x00000000)  /* Minimum IFG between frames during transmission is 96Bit */
  #define ETH_MACCR_IFG_88Bit     ((u32)0x00020000)  /* Minimum IFG between frames during transmission is 88Bit */
  #define ETH_MACCR_IFG_80Bit     ((u32)0x00040000)  /* Minimum IFG between frames during transmission is 80Bit */
  #define ETH_MACCR_IFG_72Bit     ((u32)0x00060000)  /* Minimum IFG between frames during transmission is 72Bit */
  #define ETH_MACCR_IFG_64Bit     ((u32)0x00080000)  /* Minimum IFG between frames during transmission is 64Bit */
  #define ETH_MACCR_IFG_56Bit     ((u32)0x000A0000)  /* Minimum IFG between frames during transmission is 56Bit */
  #define ETH_MACCR_IFG_48Bit     ((u32)0x000C0000)  /* Minimum IFG between frames during transmission is 48Bit */
  #define ETH_MACCR_IFG_40Bit     ((u32)0x000E0000)  /* Minimum IFG between frames during transmission is 40Bit */
#define ETH_MACCR_CSD     ((u32)0x00010000)  /* Carrier sense disable (during transmission) */
#define ETH_MACCR_FES     ((u32)0x00004000)  /* Fast ethernet speed */
#define ETH_MACCR_ROD     ((u32)0x00002000)  /* Receive own disable */
#define ETH_MACCR_LM      ((u32)0x00001000)  /* loopback mode */
#define ETH_MACCR_DM      ((u32)0x00000800)  /* Duplex mode */
#define ETH_MACCR_IPCO    ((u32)0x00000400)  /* IP Checksum offload */
#define ETH_MACCR_RD      ((u32)0x00000200)  /* Retry disable */
#define ETH_MACCR_APCS    ((u32)0x00000080)  /* Automatic Pad/CRC stripping */
#define ETH_MACCR_BL      ((u32)0x00000060)  /* Back-off limit: random integer number (r) of slot time delays before rescheduling
                                                       a transmission attempt during retries after a collision: 0 =< r <2^k */
  #define ETH_MACCR_BL_10    ((u32)0x00000000)  /* k = min (n, 10) */
  #define ETH_MACCR_BL_8     ((u32)0x00000020)  /* k = min (n, 8) */
  #define ETH_MACCR_BL_4     ((u32)0x00000040)  /* k = min (n, 4) */
  #define ETH_MACCR_BL_1     ((u32)0x00000060)  /* k = min (n, 1) */
#define ETH_MACCR_DC      ((u32)0x00000010)  /* Defferal check */
#define ETH_MACCR_TE      ((u32)0x00000008)  /* Transmitter enable */
#define ETH_MACCR_RE      ((u32)0x00000004)  /* Receiver enable */

/* Bit definition for Ethernet MAC Frame Filter Register */
#define ETH_MACFFR_RA     ((u32)0x80000000)  /* Receive all */
#define ETH_MACFFR_HPF    ((u32)0x00000400)  /* Hash or perfect filter */
#define ETH_MACFFR_SAF    ((u32)0x00000200)  /* Source address filter enable */
#define ETH_MACFFR_SAIF   ((u32)0x00000100)  /* SA inverse filtering */
#define ETH_MACFFR_PCF    ((u32)0x000000C0)  /* Pass control frames: 3 cases */
  #define ETH_MACFFR_PCF_BlockAll                ((u32)0x00000040)  /* MAC filters all control frames from reaching the application */
  #define ETH_MACFFR_PCF_ForwardAll              ((u32)0x00000080)  /* MAC forwards all control frames to application even if they fail the Address Filter */
  #define ETH_MACFFR_PCF_ForwardPassedAddrFilter ((u32)0x000000C0)  /* MAC forwards control frames that pass the Address Filter. */
#define ETH_MACFFR_BFD    ((u32)0x00000020)  /* Broadcast frame disable */
#define ETH_MACFFR_PAM 	  ((u32)0x00000010)  /* Pass all multicast */
#define ETH_MACFFR_DAIF   ((u32)0x00000008)  /* DA Inverse filtering */
#define ETH_MACFFR_HM     ((u32)0x00000004)  /* Hash multicast */
#define ETH_MACFFR_HU     ((u32)0x00000002)  /* Hash unicast */
#define ETH_MACFFR_PM     ((u32)0x00000001)  /* Promiscuous mode */

/* Bit definition for Ethernet MAC Hash Table High Register */
#define ETH_MACHTHR_HTH   ((u32)0xFFFFFFFF)  /* Hash table high */

/* Bit definition for Ethernet MAC Hash Table Low Register */
#define ETH_MACHTLR_HTL   ((u32)0xFFFFFFFF)  /* Hash table low */

/* Bit definition for Ethernet MAC MII Address Register */
#define ETH_MACMIIAR_PA   ((u32)0x0000F800)  /* Physical layer address */
#define ETH_MACMIIAR_MR   ((u32)0x000007C0)  /* MII register in the selected PHY */
#define ETH_MACMIIAR_CR   ((u32)0x0000001C)  /* CR clock range: 6 cases */
  #define ETH_MACMIIAR_CR_Div42   ((u32)0x00000000)  /* HCLK:60-72 MHz; MDC clock= HCLK/42 */
  #define ETH_MACMIIAR_CR_Div16   ((u32)0x00000008)  /* HCLK:20-35 MHz; MDC clock= HCLK/16 */
  #define ETH_MACMIIAR_CR_Div26   ((u32)0x0000000C)  /* HCLK:35-60 MHz; MDC clock= HCLK/26 */
#define ETH_MACMIIAR_MW   ((u32)0x00000002)  /* MII write */
#define ETH_MACMIIAR_MB   ((u32)0x00000001)  /* MII busy */

/* Bit definition for Ethernet MAC MII Data Register */
#define ETH_MACMIIDR_MD   ((u32)0x0000FFFF)  /* MII data: read/write data from/to PHY */

/* Bit definition for Ethernet MAC Flow Control Register */
#define ETH_MACFCR_PT     ((u32)0xFFFF0000)  /* Pause time */
#define ETH_MACFCR_ZQPD   ((u32)0x00000080)  /* Zero-quanta pause disable */
#define ETH_MACFCR_PLT    ((u32)0x00000030)  /* Pause low threshold: 4 cases */
  #define ETH_MACFCR_PLT_Minus4   ((u32)0x00000000)  /* Pause time minus 4 slot times */
  #define ETH_MACFCR_PLT_Minus28  ((u32)0x00000010)  /* Pause time minus 28 slot times */
  #define ETH_MACFCR_PLT_Minus144 ((u32)0x00000020)  /* Pause time minus 144 slot times */
  #define ETH_MACFCR_PLT_Minus256 ((u32)0x00000030)  /* Pause time minus 256 slot times */
#define ETH_MACFCR_UPFD   ((u32)0x00000008)  /* Unicast pause frame detect */
#define ETH_MACFCR_RFCE   ((u32)0x00000004)  /* Receive flow control enable */
#define ETH_MACFCR_TFCE   ((u32)0x00000002)  /* Transmit flow control enable */
#define ETH_MACFCR_FCBBPA ((u32)0x00000001)  /* Flow control busy/backpressure activate */

/* Bit definition for Ethernet MAC VLAN Tag Register */
#define ETH_MACVLANTR_VLANTC ((u32)0x00010000)  /* 12-bit VLAN tag comparison */
#define ETH_MACVLANTR_VLANTI ((u32)0x0000FFFF)  /* VLAN tag identifier (for receive frames) */

/* Bit definition for Ethernet MAC Remote Wake-UpFrame Filter Register */
#define ETH_MACRWUFFR_D   ((u32)0xFFFFFFFF)  /* Wake-up frame filter register data */
/* Eight sequential Writes to this address (offset 0x28) will write all Wake-UpFrame Filter Registers.
   Eight sequential Reads from this address (offset 0x28) will read all Wake-UpFrame Filter Registers. */
/* Wake-UpFrame Filter Reg0 : Filter 0 Byte Mask
   Wake-UpFrame Filter Reg1 : Filter 1 Byte Mask
   Wake-UpFrame Filter Reg2 : Filter 2 Byte Mask
   Wake-UpFrame Filter Reg3 : Filter 3 Byte Mask
   Wake-UpFrame Filter Reg4 : RSVD - Filter3 Command - RSVD - Filter2 Command -
                              RSVD - Filter1 Command - RSVD - Filter0 Command
   Wake-UpFrame Filter Re5 : Filter3 Offset - Filter2 Offset - Filter1 Offset - Filter0 Offset
   Wake-UpFrame Filter Re6 : Filter1 CRC16 - Filter0 CRC16
   Wake-UpFrame Filter Re7 : Filter3 CRC16 - Filter2 CRC16 */

/* Bit definition for Ethernet MAC PMT Control and Status Register */
#define ETH_MACPMTCSR_WFFRPR ((u32)0x80000000)  /* Wake-Up Frame Filter Register Pointer Reset */
#define ETH_MACPMTCSR_GU     ((u32)0x00000200)  /* Global Unicast */
#define ETH_MACPMTCSR_WFR    ((u32)0x00000040)  /* Wake-Up Frame Received */
#define ETH_MACPMTCSR_MPR    ((u32)0x00000020)  /* Magic Packet Received */
#define ETH_MACPMTCSR_WFE    ((u32)0x00000004)  /* Wake-Up Frame Enable */
#define ETH_MACPMTCSR_MPE    ((u32)0x00000002)  /* Magic Packet Enable */
#define ETH_MACPMTCSR_PD     ((u32)0x00000001)  /* Power Down */

/* Bit definition for Ethernet MAC Status Register */
#define ETH_MACSR_TSTS      ((u32)0x00000200)  /* Time stamp trigger status */
#define ETH_MACSR_MMCTS     ((u32)0x00000040)  /* MMC transmit status */
#define ETH_MACSR_MMMCRS    ((u32)0x00000020)  /* MMC receive status */
#define ETH_MACSR_MMCS      ((u32)0x00000010)  /* MMC status */
#define ETH_MACSR_PMTS      ((u32)0x00000008)  /* PMT status */

