FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth_map.h
/* Bit definition for Ethernet DMA Current Host Receive Descriptor Register */
#define ETH_DMACHRDR_HRDAP   ((u32)0xFFFFFFFF)  /* Host receive descriptor address pointer */

/* Bit definition for Ethernet DMA Current Host Transmit Buffer Address Register */
#define ETH_DMACHTBAR_HTBAP  ((u32)0xFFFFFFFF)  /* Host transmit buffer address pointer */

/* Bit definition for Ethernet DMA Current Host Receive Buffer Address Register */
#define ETH_DMACHRBAR_HRBAP  ((u32)0xFFFFFFFF)  /* Host receive buffer address pointer */

/******************************************************************************/
/*                                      Macros                                */
/******************************************************************************/
#define  SET_BIT(REG, BIT)   ((REG) |= (BIT))
#define  CLEAR_BIT(REG, BIT) ((REG) &= ~(BIT))
#define  READ_BIT(REG, BIT)  ((REG) & (BIT))

/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* ETHERNET registers base address */
#define ETH_BASE             ((u32)0x40028000)
#define ETH_MAC_BASE         (ETH_BASE)
#define ETH_MMC_BASE         (ETH_BASE + 0x0100)
#define ETH_PTP_BASE         (ETH_BASE + 0x0700)
#define ETH_DMA_BASE         (ETH_BASE + 0x1000)

/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/

/*------------------------ Non Debug Mode ------------------------------------*/
#ifndef ETH_DEBUG
#ifdef _ETH_MAC
  #define ETH_MAC            ((ETH_MAC_TypeDef *) ETH_MAC_BASE)
#endif /*_ETH_MAC */

#ifdef _ETH_MMC
  #define ETH_MMC            ((ETH_MMC_TypeDef *) ETH_MMC_BASE)
#endif /*_ETH_MMC */

#ifdef _ETH_PTP
  #define ETH_PTP            ((ETH_PTP_TypeDef *) ETH_PTP_BASE)
#endif /*_ETH_PTP */

#ifdef _ETH_DMA
  #define ETH_DMA            ((ETH_DMA_TypeDef *) ETH_DMA_BASE)
#endif /*_ETH_DMA */

/*------------------------ Debug Mode ----------------------------------------*/
#else   /* ETH_DEBUG */
#ifdef _ETH_MAC
  EXT ETH_MAC_TypeDef        *ETH_MAC;
#endif /*_ETH_MAC */

#ifdef _ETH_MMC
  EXT ETH_MMC_TypeDef        *ETH_MMC;
#endif /*_ETH_MMC */

#ifdef _ETH_PTP
  EXT ETH_PTP_TypeDef        *ETH_PTP;
#endif /*_ETH_PTP */

#ifdef _ETH_DMA
  EXT ETH_DMA_TypeDef        *ETH_DMA;
#endif /*_ETH_DMA */

#endif  /* ETH_DEBUG */

/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */

#endif /* __STM32FXXX_ETH_MAP_H */

/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/
